Fill Null values of the dataframe using median and mode

In [2]:
import pandas as pd
import numpy as np

data = {'set_of_numbers': [1,2,3,4,5,np.nan,6,7,np.nan,np.nan,8,9,10,np.nan]}
df = pd.DataFrame(data,columns=['set_of_numbers'])

#median
df.fillna(df.median())

    set_of_numbers
0              1.0
1              2.0
2              3.0
3              4.0
4              5.0
5              5.5
6              6.0
7              7.0
8              5.5
9              5.5
10             8.0
11             9.0
12            10.0
13             5.5

In [5]:
import pandas as pd
import numpy as np

data = {'set_of_numbers': [1,2,3,4,5,np.nan,6,7,np.nan,np.nan,8,9,10]}
df1 = pd.DataFrame(data,columns=['set_of_numbers'])

#mode
df1.fillna(df1.mode())

    set_of_numbers
0              1.0
1              2.0
2              3.0
3              4.0
4              5.0
5              6.0
6              6.0
7              7.0
8              9.0
9             10.0
10             8.0
11             9.0
12            10.0

Difference between merging and joining in dataframe

 df1.join(df2) always joins with the help of the index of df2, 
 but df1.merge(df2) can join to one or more columns of df2 (default) or to the index of df2 (with right_index=True).

create a data frame and add a column, add names in it and use apply function to return names whose length is greater than 5

In [8]:
d = ['genni', 'situmo', 'lisamanoban', 'jessi', 'kimJisoo']
df = pd.DataFrame(data=d, columns=['names'])
df[
df['names'].apply(lambda x: len(x)>5)]

         names
1       situmo
2  lisamanoban
4     kimJisoo

create numpy array and dataframe and concatenate them

In [4]:
arr = np.array((1, 2, 3, 4, 5))
df = pd.DataFrame([6, 7, 8, 9, 10], columns=list('A'))
df = pd.concat([df, pd.DataFrame(arr, columns = ['B'])], axis=1)
df

    A  B
0   6  1
1   7  2
2   8  3
3   9  4
4  10  5